#coding:utf-8
#
# 代码中的类名、方法名、参数名已经指定，请勿修改，直接返回方法规定的值即可
#
# 计算最大收益
# @param prices int整型一维数组 股票每一天的价格
# @return int整型
#
class Solution:
    def maxProfit(self , prices ):
        # write code here
        if not prices:
            return 0

        dp = [[0]*len(prices) for _ in range(2)]
        dp[1][0] = -prices[0]

        for i in range(1,len(prices)):
            if dp[0][i] != 0 or dp[1][i] != 0:
                continue

            dp[0][i] = max(dp[0][i-1],prices[i]+dp[1][i-1])
            dp[1][i] = max(dp[1][i-1],dp[0][i-1]-prices[i])

        return dp[0][len(prices)-1]

    def maxProfit_v1(self , prices ):
        # write code here
        if not prices:
            return 0

        dp = [[-10000]*len(prices) for _ in range(5)]
        dp[1][0] = -prices[0]
        dp[0][0] = 0

        for i in range(1,len(prices)):
            dp[0][i] = dp[0][i-1]
            dp[1][i] = max(dp[1][i-1],dp[0][i-1]-prices[i])
            dp[2][i] = max(dp[2][i-1],dp[1][i-1]+prices[i])
            dp[3][i] = max(dp[3][i-1],dp[2][i-1]-prices[i])
            dp[4][i] = max(dp[4][i-1],dp[3][i-1]+prices[i])

        return max(dp[2][len(prices)-1],max(dp[4][len(prices)-1],0))

prices = [10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000, 10000]
r = Solution()
res = r.maxProfit_v1(prices)
print(res)